export const questions = ([
    [
        [
            {q: 'Каков диапазон рабочих частот у РРС Р-427?', a: ['а) 4,4 – 5 ГГц', 'б) 1,362 – 1,463 ГГц', 'в) 1,550 – 2 ГГц', 'г) 1,348 – 1,449 ГГц']},
            {q: 'Какова минимальная скорость передачи у РРС Р-427?', a: ['а) 1 Мбит/с', 'б) 0,5 Мбит/с', 'в) 2 Мбит/с', 'г) 0,7 Мбит/с']},
            {q: 'Какой из перечисленных интерфейсов в Р-427 используется для передачи данных?', a: ['а) RS-232', 'б) Eth 10\\100\\1000Base-T', 'в) HDMI 2.0a', 'г) RS-485']},
            {q: 'Какое из перечисленных антенных устройств используются с РРС Р-427?', a: ['а) Z-образная антенна', 'б) 2ДБ11', 'в) «Волновой канал» в обтекателе', 'г) Симметричный вибратор']},
            {q: 'Каков дуплексный разнос РРС Р-427?', a: ['а) 45 МГц', 'б) 65 МГц', ' в) 70 МГц', 'г) 55 МГц']},
            {q: 'Какой вид манипуляции используется в РРС Р-427? ', a: ['а) ASK', 'б) QAM', 'в) OFDM', 'г) QPSK']},
            {q: 'Выберите состав РРС Р-427 стандартной комплектации.', a: ['а) Антенное устройство, модуль доступа', 'б) ППУ, Антенное устройство', 'в) ППУ, Антенное устройство, модуль доступа, кабельное имущество', 'г) ППУ, Антенное устройство, кабельное имущество']},
            {q: 'Какая конфигурация обеспечивает наиболее надежную работу на станции Р-427?', a: ['а) «1+1» («пространственное разнесение»)', 'б) «1+0»', 'в) «1+1» («горячий резерв»)', 'г) нет правильного ответа']},
            {q: 'Каким напряжением постоянного тока осуществляется питание РРС?', a: ['а) 24', 'б) -40,5 ...  -57', 'в) -24 ... -48', 'г) нет правильного ответа']},
            {q: 'Какая потребляемая мощность РРС в варианте применения «1+1»?', a: ['а) 50 Вт', 'б) 90 Вт', 'в) 100 Вт', 'г) 45 Вт']},
        ],
        [
            {q: 'Каков диапазон частот передачи РРС  Р-427 для исполнения «В»?', a: ['а) 4,4 – 5 ГГц', 'б) 1,550 – 2 ГГц', 'в) 1,427 – 1,463 ГГц', 'г) 1,362 – 1,398 ГГц']},
            {q: 'Какова максимальная скорость передачи у РРС Р-427?', a: ['а) 43 Мбит/с', 'б) 64 Мбит/с', 'в) 41 Мбит/с', 'г) 155 Мбит/с']},
            {q: 'Какова выходная мощность передатчика при модуляции 16QAM?', a: ['а) +25 дБм', 'б) +28 дБм', 'в) +30 дБм', 'г) +36 дБм', 'д) нет правильного ответа']},
            {q: 'Какого диаметра может быть применяемая в станции Р-427 параболическая антенна решетчатого типа?', a: ['а) 0,8 м', 'б) 0,6 м', 'в) 1 м', 'г) 1,2 м']},
            {q: 'Для чего предназначен интерфейс с названием «1+1»?', a: ['а) для включения управляющего терминала', 'б) для подключения дополнительного антенного оборудования', 'в) для подключения резервного оборудования', 'г) для подключения дополнительного терминала управления']},
            {q: 'Какой вид кабеля используется в качестве кабеля снижения? ', a: ['а) оптоволоконный кабель', 'б) кабель «витая пара»', 'в) коаксиальный кабель', 'г) силовой кабель']},
            {q: 'Каково время переключения приемопередающих устройств при конфигурации «1+1»?', a: ['а) более 70 мс', 'б) менее 50 мс', 'в) не менее 30 мс', 'г) не более 40 мс']},
            {q: 'Какова протяженность интервала при условии прямой видимости и скорости передачи до 34 Мбит/с?', a: ['а) не менее 15 км', 'б) не менее 10 км', 'в) не менее 20 км', 'г) не менее 25 км']},
            {q: 'Каково волновое сопротивление антенно-фидерного тракта?', a: ['а) 50 Ом', 'б) 70 Ом', 'в) 120 Ом', 'г) 100 Ом']},
            {q: 'Сколько места (юнитов) занимает станция в стандартном шкафу для оборудования (стативе)?', a: ['а) 1,5U', 'б) 1U', 'в) 2U', 'г) 3U']},
        ],
        [
            {q: 'Каков диапазон частот передачи РРС  Р-427 для исполнения «Н»?', a: ['а) 1,398 – 1,427 ГГц', 'б) 1,550 – 2 ГГц', 'в) 1,427 – 1,463 ГГц', 'г) 1,362 – 1,398 ГГц']},
            {q: 'Сколько портов для подключения потока Е1 имеет станция?', a: ['а) 8', 'б) 2', 'в) 6', 'г) 4']},
            {q: 'Какой интерфейс в Р-427 используется для управления станцией?', a: ['а) RS-232', 'б) Ethernet 10\\100\\1000Base-T', 'в) HDMI 2.0a', 'г) RS-485', 'д) Е1']},
            {q: 'Какая из перечисленных антенн используются с РРС Р-427?', a: ['а) Широкодиапазонная антенна', 'б) 2ДБ11', 'в) Z-образная антенна', 'г) Антенна параболическая решетчатого типа']},
            {q: 'Какова длина кабеля снижения?', a: ['а) 100 м', 'б) 55 м', 'в) 40 м', 'г) 50 м']},
            {q: 'Какой вид манипуляции не используется в РРС Р-427? ', a: ['а) 4QAM', 'б) 32QAM', 'в) 128QAM', 'г) 256QAM']},
            {q: 'Какова протяженность интервала при условии прямой видимости и скорости передачи до 8 Мбит/с?', a: ['а) не менее 25 км', 'б) не менее 40 км', 'в) не менее 35 км', 'г) не менее 30 км']},
            {q: 'Для чего предназначен интерфейс «ОБЩИЙ», «ВОЛЬТМЕТР»?', a: ['а) для измерения уровня выходного сигнала', 'б) для измерения напряжения питания', 'в) для измерения напряжения входного сигнала при юстировке антенны', 'г) для калибровки напряжения питания']},
            {q: 'Какие действия запрещено производить при включенном питании станции?', a: ['а) подключать/отключать кабели типа FTP-5', 'б) изменять конфигурацию оборудования', 'в) подключать/отключать вольтметр к ППУ', 'г) подключать/отключать антенно-фидерный тракт']},
            {q: 'Для отображении информации о состоянии чего предназначен индикатор «РАДИО»?', a: ['а) для отображения информации о состоянии принимаемого сигнала', 'б) для отображения информации о состоянии сигнала на передачу', 'в) для отображения информации о состоянии антенного устройства', 'г) нет правильного ответа']},
        ],
        [
            {q: 'Какого диаметра может быть применяемая в станции Р-427 параболическая антенна решетчатого типа?', a: ['а) 1,5 м', 'б) 0,5 м', 'в) 1,2 м', 'г) 0,9 м']},
            {q: 'Сколько портов для передачи данных с использованием технологии Ethernet имеет станция?', a: ['а) 2', 'б) 4', 'в) 8', 'г) 6']},
            {q: 'При каком виде манипуляции максимальная выходная мощность передатчика составляет 36 дБм?', a: ['а) 128QAM', 'б) 32QAM', 'в) 4QAM', 'г) 16QAM']},
            {q: 'Каков максимальный размер кадра?', a: ['а) 2048 байт', 'б) 2176 байт', 'в) 1536 байт', 'г) 1896 байт']},
            {q: 'Каков диапазон рабочей температуры внешнего оборудования (ºС)?', a: ['а) от минус 40 до плюс 50', 'б) от минус 40 до плюс 60', 'в) от минус 10 до плюс 40', 'г) от 0 до плюс 30']},
            {q: 'Какова масса приемопередающего устройства? ', a: ['а) 5,2 кг', 'б) 3,5 кг', 'в) 6,1 кг', 'г) 8,5 кг']},
            {q: 'Какова протяженность интервала при условии прямой видимости и скорости передачи до 16 Мбит/с?', a: ['а) не менее 25 км', 'б) не менее 40 км', 'в) не менее 35 км', 'г) не менее 30 км']},
            {q: 'Для чего предназначен интерфейс «СЛУЖ. СВЯЗЬ»?', a: ['а) для организации громкоговорящей служебной связи', 'б) для организации служебной связи при подключении микротелефонной гарнитуры', 'в) для организации служебной связи при подключении ПЭВМ', 'г) нет правильного ответа']},
            {q: 'На каком расстоянии необходимо располагать антенны при работе в режиме «1+1» («пространственное разнесение»)?', a: ['а) 5 - 10 м', 'б) 15 - 20 м', 'в) 10 - 12 м', 'г) 14 - 16 м']},
            {q: 'О чем не может сообщить световая индикация «ВНУТР. БЛОК»?', a: ['а) о нормальной работе приемопередающего устройства', 'б) о наличии ошибок в принимаемом сигнале', 'в) о пропадании напряжения источника питания', 'г) о неисправности изделия']},
        ],
        [
            {q: 'Какова длина антенны типа «волновой канал» в обтекателе?', a: ['а) 2 м', 'б) 0,7 м', 'в) 1,3 м', 'г) 1 м']},
            {q: 'Какова максимальная ширина полосы пропускания?', a: ['а) 8,0 МГц', 'б) 4,0 МГц', 'в) 7,0 МГц', 'г) 5,0 МГц']},
            {q: 'При каком виде манипуляции максимальная выходная мощность передатчика составляет 34 дБм?', a: ['а) 128QAM', 'б) 16QAM', 'в) 4QAM', 'г) 32QAM']},
            {q: 'Какова протяженность интервала при условии прямой видимости и скорости передачи до 2 Мбит/с?', a: ['а) не менее 50 км', 'б) не менее 40 км', 'в) не менее 70 км', 'г) не менее 60 км']},
            {q: 'Каков диапазон рабочей температуры внутреннего оборудования (ºС)?', a: ['а) от минус 10 до плюс 40', ' б) от 0 до плюс 50', 'в) от минус 20 до плюс 40', 'г) от 0 до плюс 30']},
            {q: 'Какой вид кабеля используется для подключения трафика Ethernet? ', a: ['а) силовой кабель', 'б) коаксиальный кабель', 'в) кабель «витая пара»', 'г) оптоволоконный кабель']},
            {q: 'О чем может сообщить световая индикация «СИСТ.»?', a: ['а) об отсутствии связи или неисправности какого-либо узла приемопередающего устройства', 'б) о нормальной работе всех узлов приемопередающего устройства', 'в) о неустойчивой работе внутреннего оборудования, при котором связь не прерывается', 'г) обо всем вышеперечисленном']},
            {q: 'Какие лица допускаются к работе с радиорелейным оборудованием РРС Р-427?', a: ['а) знание принципа работы Р-427', 'б) знание общего принципа работы радиорелейных станций', 'в) знание руководство по эксплуатации Р-427', 'г) знание принципа работы Р-427 и руководства по эксплуатации Р-427']},
            {q: 'Каков диапазон скорости передачи информации у РРС Р-427?', a: ['а) 0,7 - 43 Мбит/с', 'б) 2 - 2,3 Мбит/с', 'в) 2 - 8 Мбит/с', 'г) 8 - 34 Мбит/с']},
            {q: 'Какова протяженность интервала при условии прямой видимости и скорости передачи до 4 Мбит/с?', a: ['а) не менее 35 км', 'б) не менее 40 км', 'в) не менее 30 км', 'г) не менее 45 км']},
        ],
    ],
    [
        [
            {q: 'Какой порт предназначен для подключения к ПЭВМ при настройки с помощью Web-браузера?', a: ['а) Упр. RS-232', 'б) Ethernet 10\\100\\1000', 'в) Внешн. RS-232', 'г) E1']},
            {q: 'Какой индикатор заморгает зеленым цветом сразу после установки переключателя «ПИТАНИЕ» в положение «ВКЛ.»?', a: ['а) «МОДЕМ»', 'б) «СИСТ.»', 'в) «РАДИО»', 'г) «ВНУТР. БЛОК»']},
            {q: 'Какую жидкость разрешено применять для протирки оборудования станции?', a: ['а) растворитель', 'б) бензин', 'в) мыльный раствор', 'г) нет правильного ответа']},
            {q: 'С чего необходимо начать настройку станции с помощью Web-браузера?', a: ['а) с ввода IP-адреса в строку поиска браузера', 'б) с проверки (установки) необходимого IP-адреса и маски подсети компьютера', 'в) с авторизации (ввода имени пользователя и пароля)', 'г) с проверки качества связи']},
            {q: 'Какие настройки невозможно установить в мастере конфигурации?', a: ['а) установить название РРС', 'б) ограничить скорость передачи по портам Ethernet', 'в) включить/отключить порты Е1', 'г) изменить IP-адрес РРС']},
            {q: 'Есть ли возможность конфигурировать удаленную станцию?', a: ['а) да, можно конфигурировать в любом случае', 'б) нет, такой возможности не предусмотрено', 'в) да, можно конфигурировать в случае установления связи', ' г) да, можно конфигурировать в случае работы станций на одной частоте']},
            {q: 'Для настройки станции каким способом используется последовательный порт управления RS-232?', a: ['а) c помощью Web-браузера', 'б) c помощью терминала Telnet', 'в) c помощью терминала NMS Web-браузера', 'г) c помощью ПО Hyper Terminal']},
            {q: 'О чем свидетельствует постоянно горящий красным цветом левый светодиодный индикатор интерфейса Е1?', a: ['а) указывает на потерю канала Е1', 'б) указывает на нарушение биполярности сигнала', 'в) говорит о том, что от пользовательского оборудования поступает сигнал индикации неисправности', 'г) указывает на включенный в этом канале режим аналоговой, цифровой или удаленной проверки петлями']},
            {q: 'Какая строка в Web-окне «Статус РРЛ» информирует от том, удалось ли центральному процессору управления корректно считать данные, необходимые для управления РРС', a: ['а) состояние РРЛ', 'б) состояние модема', 'в) состояние РРС', 'г) управление модема']},
            {q: 'Какой параметр невозможно настроить во вкладке «Основная конфигурация»', a: ['а) установить вид цифровой модуляции', 'б) включить/отключить порты Е1', 'в) установить IP-адрес станции', 'г) установить частоту передатчика']}
        ],
        [
            {q: 'Какой порт предназначен для подключения к ПЭВМ при настройки с помощью ПО Hyper Terminal?', a: ['а) Упр. RS-232', 'б) 1+1', 'в) Е1', 'г) Ethernet 10\\100\\1000']},
            {q: 'Какие индикаторы загорятся после загрузки внутренней программы приемопередающего устройства?', a: ['а) «МОДЕМ», «СИСТ.», «РАДИО»', 'б) «СИСТ.», «ВНУТР. БЛОК», «РАДИО»', 'в) «РАДИО», «ВНУТР. БЛОК», «МОДЕМ»', 'г) «СИСТ.», «РАДИО», «ВНУТР.БЛОК»']},
            {q: 'С помощью какого интерфейса можно провести юстировку антенн?', a: ['а) «УПР. RS-232»', 'б) «1+1»', 'в) «СЛУЖ. СВЯЗЬ»', 'г) «ОБЩИЙ», «ВОЛЬТМЕТР»']},
            {q: 'Какие настойки последовательного порта необходимо установить при конфигурации станции с помощью ПО Hyper Terminal?', a: ['а) скорость: 19200 бит/с; биты данных: 8; четность: нет; стоповые биты: 1; управление потоком данных: нет ', 'б) скорость: 19200 бит/с; биты данных: 8; четность: нет; стоповые биты: 1; управление потоком данных: xon/xoff', 'в) скорость: 9600 бит/с; биты данных: 8; четность: нет; стоповые биты: 1; управление потоком данных: нет', 'г) скорость: 19200 бит/с; биты данных: 8; четность: да; стоповые биты: 1; управление потоком данных: нет']},
            {q: 'Какие настройки невозможно установить в мастере конфигурации?', a: ['а) установить название РРС', 'б) установить мощность передатчика', 'в) включить/отключить порты Е1', 'г) нет правильного ответа']},
            {q: 'Необходимо ли вручную устанавливать частоту приемника?', a: ['а) да, необходимо в любом случае', 'б) нет, она устанавливается автоматически', 'в) да, необходимо после установки частоты передатчика', 'г) нет, но такая возможность присутствует']},
            {q: 'О чем свидетельствует постоянно горящий зеленым цветом левый светодиодный индикатор интерфейса LAN RJ-45?', a: ['а) наблюдается активность по локальной сети', 'б) осуществляется передача данных со скоростью 100 Мбит/с', 'в) соединение по локальной сети установлено', 'г) осуществляется передача данных со скоростью передачи 10 Мбит/с']},
            {q: 'О чем свидетельствует постоянно горящий желтым цветом правый светодиодный индикатор интерфейса Е1?', a: ['а) говорит о том, что от пользовательского оборудования поступает сигнал индикации неисправности', 'б) указывает на нарушение биполярности сигнала', 'в) указывает на передачу/прием информации в данных момент', 'г) указывает на включенный в этом канале режим аналоговой, цифровой или удаленной проверки петлями']},
            {q: 'Какое сообщение отображается в строке «Состояние модема» при нормальной работе?', a: ['а) «Норма»', 'б) «Синхронизирован»', 'в) «Исправен»', 'г) «Включен»']},
            {q: 'Какой параметр возможно настроить во вкладке «Конфигурация системы»', a: ['а) установить мощность передатчика', 'б) установить ширину полосы радиоканала', 'в) включить/отключить порты Е1', 'г) синхронизировать время и дату с ПЭВМ']}
        ]
    ],
    // [
    //     [
    //         {q: 'Вопрос с правильным ответом №1.', a: ['Ответ №1', 'Ответ №2']}
    //     ]
    // ]
]);

export const answerMap = [
    [
        [1,3,1,2,1,1,3,0,1,1],
        [2,0,4,1,2,2,1,0,0,2],
        [3,3,0,3,2,3,2,2,3,0],
        [,21,2,2,1,0,0,1,2,1],
        [2,0,3,3,0,2,3,3,0,3]
    ],
    [
        [1,1,2,1,1,2,3,0,2,2],
        [0,2,3,0,3,1,2,3,1,3]
    ],
    // [
    //     [0,1]
    // ]
]
