export const questions = ([
    [
        [
            {q: 'Вопрос с правильным ответом №1.', a: ['Ответ №1', 'Ответ №2']},
            {q: 'Вопрос с правильным ответом №2.', a: ['Ответ №1', 'Ответ №2']}
        ],
        [
            {q: 'Вопрос с правильным ответом №1.', a: ['Ответ №1', 'Ответ №2']},
            {q: 'Вопрос с правильным ответом №2.', a: ['Ответ №1', 'Ответ №2']}
        ],
    ],
    [
        [
            {q: 'Вопрос с правильным ответом №1.', a: ['Ответ №1', 'Ответ №2']},
            {q: 'Вопрос с правильным ответом №2.', a: ['Ответ №1', 'Ответ №2']}
        ],
        [
            {q: 'Вопрос с правильным ответом №1.', a: ['Ответ №1', 'Ответ №2']},
            {q: 'Вопрос с правильным ответом №2.', a: ['Ответ №1', 'Ответ №2']}
        ],
    ],
    [
        [
            {q: 'Вопрос с правильным ответом №1.', a: ['Ответ №1', 'Ответ №2']},
            {q: 'Вопрос с правильным ответом №2.', a: ['Ответ №1', 'Ответ №2']}
        ],
        [
            {q: 'Вопрос с правильным ответом №1.', a: ['Ответ №1', 'Ответ №2']},
            {q: 'Вопрос с правильным ответом №2.', a: ['Ответ №1', 'Ответ №2']}
        ],
    ]
]);

export const answerMap = [ // draft for now
    [
        [0,1],
        [0,1]
    ],
    [
        [0,1],
        [0,1]
    ],
    [
        [0,1],
        [0,1]
    ],
]
